{"modelTopology": {"model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "name": "dense", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "batch_input_shape": [null, 16], "units": 35, "activation": "relu", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout", "noise_shape": null, "dtype": "float32", "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activation": "relu", "trainable": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1", "noise_shape": null, "dtype": "float32", "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "activation": "sigmoid", "trainable": true, "kernel_constraint": null}}], "name": "sequential"}}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "weighted_metrics": null, "metrics": ["accuracy"], "loss_weights": null, "loss": "binary_crossentropy", "optimizer_config": {"class_name": "SGD", "config": {"momentum": 0.8999999761581421, "learning_rate": 0.0949999988079071, "decay": 0.0003800000122282654, "nesterov": true, "name": "SGD"}}}}, "format": "layers-model", "generatedBy": "keras v2.2.4-tf", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [16, 35], "name": "dense/kernel"}, {"dtype": "float32", "shape": [35], "name": "dense/bias"}, {"dtype": "float32", "shape": [35, 10], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [10, 2], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_2/bias"}], "paths": ["group1-shard1of1.bin"]}], "convertedBy": "TensorFlow.js Converter v1.1.2"}